// здесь будут решение простых задач из курса
Процедура ПриНачалеРаботыСистемы()
	
	//Задача 1: Проверить является ли строка числом
	//Нужно разработать программный код, который должен определить является
	//ли введенная пользователем строка числом (содержит только цифры и символ ".").
	#Область Задача1
//	ЧислаИТочка = "0123456789.,";
//	ДанныеВвода = "";
//	ВвестиСтроку(ДанныеВвода, "Введите число", , );
//	ЭтоЧисло = Истина;
//	
////Счетчик для подсчета количества точек и запятых, если больше 1 то это уже не цифра.
//	КоличествоТочекИЗапятый = 0;
//	
//	Для НомерСимвола = 1 По СтрДлина(ДанныеВвода) Цикл
//		
//		Если СтрНайти(ЧислаИТочка, Сред(ДанныеВвода, НомерСимвола, 1)) <> 0 Тогда
//			
//			Если Сред(ДанныеВвода, НомерСимвола, 1) ="." ИЛИ Сред(ДанныеВвода, НомерСимвола, 1) ="," Тогда
//				КоличествоТочекИЗапятый = КоличествоТочекИЗапятый + 1;
//			
//			ИначеЕсли КоличествоТочекИЗапятый >1 Тогда
//				Сообщить("Это не число!");
//				ЭтоЧисло = Ложь;
//				Прервать;
//			КонецЕсли;
//			ЭтоЧисло = Истина;
//				
//				
//		Иначе 
//			 ЭтоЧисло = Ложь;
//			 Сообщить("Это не число!");
//			 Прервать;
//		КонецЕсли;
//			 
//	КонецЦикла;
//	
//	Если ЭтоЧисло = Истина Тогда
//		Сообщить("Это Число!");
//	КонецЕсли;
	#КонецОбласти

	//Задача 2: Убрать из строки все цифры
	//Нужно разработать программный код, который удалит из строки, которую
	//вводит пользователь, все цифры и двойные пробелы
	#Область Задача2


//	ДанныеПользователя = "";
//	ВвестиСтроку(ДанныеПользователя, "Введите строку", , );
//	
//	ЧислаИЗнаки = "0123456789";
//	
//	ИсправленнаяСтрока ="";
//	
//	Для НомерСимвола = 1 По СтрДлина(ДанныеПользователя) Цикл
//		
//		Если СтрНайти(ЧислаИЗнаки, Сред(ДанныеПользователя, НомерСимвола, 1)) <> 0 Тогда
//				
//				Продолжить;
//			
//		ИначеЕсли СтрНайти(ЧислаИЗнаки, Сред(ДанныеПользователя, НомерСимвола, 1)) = 0 Тогда
//			
//			Если Сред(ДанныеПользователя, НомерСимвола, 1) = " " И  Сред(ДанныеПользователя, НомерСимвола - 2, 1) = " "
//			И (НомерСимвола > 1 И НомерСимвола <> СтрДлина(ДанныеПользователя) - 1) Тогда
//				  
//				  Продолжить;
//			
//			ИначеЕсли (Сред(ДанныеПользователя, НомерСимвола, 1) = " " И (НомерСимвола -1) = 0) Тогда 				
//				
//				Продолжить;
//			
//			ИначеЕсли  Сред(ДанныеПользователя, НомерСимвола -1, 1) = " " и Сред(ДанныеПользователя, НомерСимвола +1, 1) = " " 
//			ИЛИ (Сред(ДанныеПользователя, НомерСимвола, 1) = " " И Сред(ДанныеПользователя, НомерСимвола +1, 1) = " ")   
//			ИЛИ (Сред(ДанныеПользователя, НомерСимвола - 1, 1) = " " И Сред(ДанныеПользователя, НомерСимвола, 1) = " ") 
//			Тогда
//		
//				ИсправленнаяСтрока = ИсправленнаяСтрока + "";
//				
//				Продолжить;
//					
//			Иначе
//				
//				ИсправленнаяСтрока = ИсправленнаяСтрока + Сред(ДанныеПользователя, НомерСимвола, 1);
//				
//			КонецЕсли;
//			
//		КонецЕсли;
//	
//	КонецЦикла;
//	
//	Сообщить(ИсправленнаяСтрока);
#КонецОбласти
	
	//Задача 3 Удалить из строки повторяющиеся символы
	//Вводится строка. Требуется удалить из нее повторяющиеся символы и все
	//пробелы.
	//Например, если было введено "abc cde def", то должно быть выведено
	//"abcdef".
	#Область Задача3
//	ИсходнаяСтрока = "";
//	ВвестиСтроку(ИсходнаяСтрока, "Введите строку", , );
//	
//	СтрокаБезПовторов = "";
//	
//	Для НомерСимвола = 1 По СтрДлина(ИсходнаяСтрока) Цикл
//	
//		Буква = Сред(ИсходнаяСтрока, НомерСимвола, 1);
//		
//		Если Буква = " " Тогда
//			Продолжить;
//			
//		ИначеЕсли СтрНайти(СтрокаБезПовторов, Буква) > 0  Тогда
//			Продолжить;
//			
//		КонецЕсли;
//			
//		СтрокаБезПовторов = СтрокаБезПовторов + Буква;
//		 
//	КонецЦикла;
//	
//	Сообщить(СтрокаБезПовторов);
	#КонецОбласти

	//Задача 4 : Количество слов в строке
	//Вводится строка, состоящая из слов, разделенных пробелами. Требуется посчитать количество слов в ней. 
	//Словом считается непрерывная последовательность символов. Примечание: между словами может быть больше одного пробела.
	//
	//Пример:
	//Исходная строка: "красный белый желтый синий "
	//Результат: 4 слова 
	#Область Задача4
//ИсходнаяСтрока = ""; 	
//ВвестиСтроку(ИсходнаяСтрока, "Ввести строку" , , );
//
//КоличествоСлов = 0;
//
//Слово = "";	
//	
//	
//Для Шаг = 1 По СтрДлина(ИсходнаяСтрока) Цикл
//	
//	МыВСлове = Истина;
//	
//	Если Сред(ИсходнаяСтрока, Шаг, 1) = " " Тогда 
//		Продолжить;
//	Иначе
//	Пока МыВСлове = Истина Цикл
//			
//			НомерСимвола = Шаг;
//			
//			Буква = Сред(ИсходнаяСтрока, НомерСимвола, 1);
//			
//			Если Буква <> " " И Буква <> "" Тогда
//				МыВСлове = Истина;
//				НомерСимвола = НомерСимвола + 1;
//				Шаг = Шаг + 1;
//			Иначе
//				МыВСлове = Ложь;
//				КоличествоСлов = КоличествоСлов + 1;
//			КонецЕсли;
//	
//		КонецЦикла;		
//	
//	КонецЕсли;
//
//КонецЦикла;
//
//Сообщить("" + КоличествоСлов + " " + "слова")
#КонецОбласти
	
	//Задача 5: Определить расширение файла
	//В переменной ПутьКФайлу содержится путь к файлу с данными:
	//"E:\IRONSKILLS\Выписки\20210916.xml". Нужно имея этот путь определить
	//расширение файла ("XML", "XLS", "TXT" и т.д). Расширение файла нужно
	//сообщить пользователю.
	
	#Область Задача5
	//	ИсходнаяСтрока ="";
	//	ВвестиСтроку(ИсходнаяСтрока,"Введите путь к файлу" , , );
	//	
	//	НазваниеРасширения ="";
	//	
	//	Для Итерация = 0 по СтрДлина(ИсходнаяСтрока) Цикл
	//		
	//		НомерЗнака = СтрДлина(ИсходнаяСтрока) - Итерация; 
	//		Знак = Сред(ИсходнаяСтрока, НомерЗнака, 1);
	//		
	//		Если Знак ="." Тогда
	//			Прервать;
	//		Иначе
	//			НазваниеРасширения = Знак + НазваниеРасширения;
	//		КонецЕсли;
	//			
	//	КонецЦикла;
	//	
	//	Сообщить("Расширение файла: " + ВРег(НазваниеРасширения));
	#КонецОбласти
	
	//Задача 6: Представление даты
	//Нужно написать программный код, который по дате в формате ГГГГММДД
	//получит представление в виде "ДД МесяцСтрокой ГГГГ г.".
	//Пример:
	//Исходная дата: 20200324
	//Результат: 24 марта 2020 г
	
	#Область Задача6
	//ИсходнаяСтрока ="";
	//ВвестиСтроку(ИсходнаяСтрока, "Введите дату в формате ГГГГММДД" , 8, );
	//
	//ДатаИсходная = Дата(ИсходнаяСтрока);
	//ДатаВНовомФормате = Формат(ДатаИсходная, "ДЛФ=DD;");
	//Сообщить(ДатаВновомФормате);
	#КонецОбласти
	
//	Задача 7; Разница дат в календарных днях
//	Нужно написать программный код, который вычислит разницу в
//	календарных днях между двумя датами и сообщит пользователю.
	
	#Область Задача7
//	Дата1 = 00010101;
//	ВвестиДату(Дата1, "Введите первую дату", );
//	
//	Дата2 = 00010101;
//	ВвестиДату(Дата2, "Введите вторую дату", );
//	
//	Разность = (Дата2 - Дата1) / 86400;
//	
//	Сообщить("" + Разность + " дня.");
	#КонецОбласти
	
	//	Задача 8 :Количество рабочих и выходных дней
	//Нужно написать программный код, который вычислит количество рабочих и
	//выходных дней между двумя датами и сообщит пользователю.
	//Рабочим считается день с понедельника по пятницу. Выходной - суббота или
	//воскресенье.
	
	#Область Задача8
	//	Дата1 = 00010101;
	//	ВвестиДату(Дата1, "Введите начальную дату", );
	//	
	//	Дата2 = 00010101;
	//	ВвестиДату(Дата2, "Введите конечную дату", );
	//	
	//	СписокДат = Новый СписокЗначений;
	//	
	//	ТекДата = Дата1;
	//	
	//	КоличествоРабДней = 0;
	//	КоличествоВыходныхДней = 0;
	//	
	//	Пока ТекДата <= Дата2 Цикл
	//		
	//		СписокДат.Добавить(ТекДата);
	//		
	//		Если ДеньНедели(ТекДата) = 6 ИЛИ ДеньНедели(ТекДата) = 7 ТОГДА
	//			КоличествоВыходныхДней = КоличествоВыходныхДней + 1;
	//		Иначе 
	//			КоличествоРабДней = КоличествоРабДней + 1;
	//		КонецЕсли;
	//		
	//		ТекДата = ТекДата + 60 * 60 * 24;
	//		
	//	КонецЦикла;
	//	
	//	Сообщить("" + КоличествоРабДней + "  рабочих дней" + Символ(10) + КоличествоВыходныхДней + " выходных дней.");
		#КонецОбласти
	
	//	Задача 9: Формат даты
	//Выведите 1-го сентября текущего года в формате '2020.09.01'. 
	
	#Область Задача9
	//	ПервоеСентября = Дата(2024, 09, 01);
	//	ФорматированноеПервоеСентября = Формат(ПервоеСентября,"ДФ=гггг.ММ.дд;" );
	//	Сообщить(ФорматированноеПервоеСентября);
	#КонецОбласти
	
//	Задача 10: Преобразовать сумму строкой в число
//	Нужно из строки вида "x руб. y коп." получить сумму в виде числа и
//	сообщить пользователю.
//	Пример:
//	Исходная строка: 127 руб. 25 коп.
//	Результат (число): 127.25
	
	#Область Задача10


	
//	ИсходнаяСтрока = "";
//	ЦифрыИТочка = "0123456789.";
//	ВвестиСтроку(ИсходнаяСтрока, "Введите строку", , );
//	Результат = "";
//	КоличествоТочек = 0;
//	
//	Для НомерСимвола = 1 ПО СтрДлина(ИсходнаяСтрока) Цикл
//		
//		Символ = Сред(ИсходнаяСтрока, НомерСимвола, 1);
//		
//		Если Символ = "." Тогда
//				КоличествоТочек = КоличествоТочек + 1;
//		КонецЕсли;
//		
//		Если СтрНайти(ЦифрыИТочка, Символ) < 0 ИЛИ КоличествоТочек > 1  Тогда
//			 
//			 Продолжить;
//		
//		ИначеЕсли СтрНайти(ЦифрыИТочка, Символ) > 0 Тогда
//			
//			Результат = Результат + Символ;
//			
//		КонецЕсли;
//		
//	КонецЦикла;
//
//	Сообщить(Результат);
	#КонецОбласти

//	Задача 11: Преобразовать дату строкой в дату
//	Нужно из строки вида "12 февраля 2020 г." получить дату и сообщить
//	пользователю.
//	Пример:
//	Исходная строка: "24 марта 2020 г."
//	Результат (дата): 24.03.2020 
	
	#Область Задача11
//	Цифры ="0123456789";
//	ИсходнаяСтрока = "";
//	ВвестиСтроку(ИсходнаяСтрока, "Введите дату в формате 'дд ММ ГГГГ г.' ", , );
//	
//	РезультатСЧисловымМесяцем = "";
//	
//	Результат ="";
//
//	Если СтрНайти(ИсходнаяСтрока, "января") > 0 Тогда
//			РезультатСЧисловымМесяцем = СтрЗаменить(ИсходнаяСтрока, "января" , "01");
//    ИначеЕсли СтрНайти(ИсходнаяСтрока, "янв") > 0 Тогда
//		    РезультатСЧисловымМесяцем = СтрЗаменить(ИсходнаяСтрока, "янв" , "01");
//	ИначеЕсли СтрНайти(ИсходнаяСтрока, "февраля") > 0 Тогда
//			РезультатСЧисловымМесяцем = СтрЗаменить(ИсходнаяСтрока, "февраля" , "02");
//    ИначеЕсли СтрНайти(ИсходнаяСтрока, "фев") > 0 Тогда
//		    РезультатСЧисловымМесяцем = СтрЗаменить(ИсходнаяСтрока, "фев" , "02");
//	ИначеЕсли СтрНайти(ИсходнаяСтрока, "марта") > 0 Тогда
//			РезультатСЧисловымМесяцем = СтрЗаменить(ИсходнаяСтрока, "марта" , "03");
//    ИначеЕсли СтрНайти(ИсходнаяСтрока, "мар") > 0 Тогда
//		    РезультатСЧисловымМесяцем = СтрЗаменить(ИсходнаяСтрока, "мар" , "03");
//	ИначеЕсли СтрНайти(ИсходнаяСтрока, "апреля") > 0 Тогда
//			РезультатСЧисловымМесяцем = СтрЗаменить(ИсходнаяСтрока, "апреля" , "04");
//    ИначеЕсли СтрНайти(ИсходнаяСтрока, "апр") > 0 Тогда
//		    РезультатСЧисловымМесяцем = СтрЗаменить(ИсходнаяСтрока, "апр" , "04");
//	ИначеЕсли СтрНайти(ИсходнаяСтрока, "мая") > 0 Тогда
//			РезультатСЧисловымМесяцем = СтрЗаменить(ИсходнаяСтрока, "мая" , "05");
//	ИначеЕсли СтрНайти(ИсходнаяСтрока, "июня") > 0 Тогда
//			РезультатСЧисловымМесяцем = СтрЗаменить(ИсходнаяСтрока, "июня" , "06");
//    ИначеЕсли СтрНайти(ИсходнаяСтрока, "июн") > 0 Тогда
//		    РезультатСЧисловымМесяцем = СтрЗаменить(ИсходнаяСтрока, "июн" , "06");
//	ИначеЕсли СтрНайти(ИсходнаяСтрока, "июля") > 0 Тогда
//			РезультатСЧисловымМесяцем = СтрЗаменить(ИсходнаяСтрока, "июля" , "07");
//    ИначеЕсли СтрНайти(ИсходнаяСтрока, "июл") > 0 Тогда
//		    РезультатСЧисловымМесяцем = СтрЗаменить(ИсходнаяСтрока, "июл" , "07");
//	ИначеЕсли СтрНайти(ИсходнаяСтрока, "августа") > 0 Тогда
//			РезультатСЧисловымМесяцем = СтрЗаменить(ИсходнаяСтрока, "августа" , "08");
//    ИначеЕсли СтрНайти(ИсходнаяСтрока, "авг") > 0 Тогда
//		    РезультатСЧисловымМесяцем = СтрЗаменить(ИсходнаяСтрока, "авг" , "08");
//	ИначеЕсли СтрНайти(ИсходнаяСтрока, "сентября") > 0 Тогда
//			РезультатСЧисловымМесяцем = СтрЗаменить(ИсходнаяСтрока, "сентября" , "09");
//     ИначеЕсли СтрНайти(ИсходнаяСтрока, "сен") > 0 Тогда
//		    РезультатСЧисловымМесяцем = СтрЗаменить(ИсходнаяСтрока, "сен" , "09");
//	ИначеЕсли СтрНайти(ИсходнаяСтрока, "октября") > 0 Тогда
//			РезультатСЧисловымМесяцем = СтрЗаменить(ИсходнаяСтрока, "октября" , "10");
//    ИначеЕсли СтрНайти(ИсходнаяСтрока, "окт") > 0 Тогда
//		    РезультатСЧисловымМесяцем = СтрЗаменить(ИсходнаяСтрока, "окт" , "10");
//	ИначеЕсли СтрНайти(ИсходнаяСтрока, "ноября") > 0 Тогда
//			РезультатСЧисловымМесяцем = СтрЗаменить(ИсходнаяСтрока, "ноября" , "11");
//     ИначеЕсли СтрНайти(ИсходнаяСтрока, "ноя") > 0 Тогда
//		    РезультатСЧисловымМесяцем = СтрЗаменить(ИсходнаяСтрока, "ноя" , "11");
//	ИначеЕсли СтрНайти(ИсходнаяСтрока, "декабря") > 0 Тогда
//			РезультатСЧисловымМесяцем = СтрЗаменить(ИсходнаяСтрока, "декабря" , "12");
//      ИначеЕсли СтрНайти(ИсходнаяСтрока, "дек") > 0 Тогда
//		    РезультатСЧисловымМесяцем = СтрЗаменить(ИсходнаяСтрока, "дек" , "12");
//	КонецЕсли;		
//			
//	Для НомерСимвола = 1  ПО СтрДлина(РезультатСЧисловымМесяцем) Цикл
//		
//		Символ = Сред(РезультатСЧисловымМесяцем, НомерСимвола, 1);
//		
//		Если СтрНайти(Цифры, Символ ) > 0 Тогда
//			
//			Результат = Результат + Символ;
//		Иначе	
//			Продолжить;
//			
//		КонецЕсли;
//	
//	КонецЦикла;
//	
//	
//	Год = Прав(Результат, 4);
//	Месяц = Сред(Результат, 3, 2);
//	День = Лев(Результат, 2);
//
//	Результат = Формат(Дата(Год, Месяц, День), "ДФ=dd.MM.yyyy;"); 
//	Сообщить(Результат);
	#КонецОбласти
	
	#Область Задача12
////	
////	Задача 12: Напишите программный код, по созданию и заполнению массива целыми
////	числами от 1 до 50.
////	После заполнения массива нужно вычислить среднее арифметическое чисел
////	в массиве.
////	Среднее арифметическое = Сумма чисел / Количество чисел
//
//	Массив50 = Новый Массив;
//	НачальныйИндекс = 0;
//	
//	Для Значение = 1 По 50 Цикл
//		
//		Массив50.Добавить(Значение);
//		
//	КонецЦикла;
//	
//	Для Каждого Элемент Из Массив50 Цикл
//		
//		Сообщить(Элемент);
//	
//	КонецЦикла;
	#КонецОбласти
	
//	Задача 13:
//	В программном коде описан массив, состоящий из чисел.
//	Напишите программный код, который определит минимальный и
//	максимальный элемент в массиве и сообщит результат пользователю.
//	Пример: 17,15,6,7,99,52,14
	
//	СписокЧисел = "17,15,6,7,99,52,14";
	
//	МассивЧисел = СтрРазделить(СписокЧисел, ",");
		
	Для Индекс = 0 По МассивЧисел.ВГраница()-1 Цикл
		
		МассивЧисел[Индекс] = Число(МассивЧисел[Индекс]);
	
	КонецЦикла;
	
	
	
	
КонецПроцедуры
